Revit 2027 API
MetalPerforationsType Enumeration
 The enumerated type representing the permitted values for the asset property "MetalPerforations" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MetalPerforationsType
Public Enumeration MetalPerforationsType
public enum class MetalPerforationsType
type MetalPerforationsType
Members
Member name | Value | Description
CirclesStaggered | 1
CirclesStraight | 2
Cloverleaf | 5
Custom | 7
Grecian | 4
Hexagon | 6
None | 0
Squares | 3
See Also
Reference
Autodesk.Revit.DB.Visual Namespace